app/views/places/index.html.erb

SELECT 1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = 2 AND "subscriptions"."place_id" = 1 LIMIT 1
---
        <% if current_user.right == 'user' %>
        <% if Subscription.exists?(user_id: current_user.id, place_id: place.id) %>